In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [33]:
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [5]:
obj2 = Series([4,7,-5,3], index=['d','b','a','c'])

In [6]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2['a']

-5

In [9]:
obj2['d']

4

In [12]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [13]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [14]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [17]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [18]:
'b' in obj2

True

In [19]:
'e' in obj2

False

In [20]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000,'Utah':5000}

In [21]:
obj3 = Series(sdata)

In [22]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
states = ['California','Ohio','Oregon','Texas']

In [24]:
obj4 = Series(sdata, index=states)

In [25]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [27]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [29]:
obj4.name = 'population'

In [30]:
obj4.index.name = 'state'

In [31]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

DataFrame

In [3]:
# Dict of Series
# row-oriented and column-oriented operations are treated roughly symmetrically
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
       'year':[2000,2001,2002,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data)

In [4]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [5]:
DataFrame(data, columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [6]:
frame2 = DataFrame(data, columns=['year','state','pop','debt'],
                  index = ['one','two','three','four','five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [7]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [8]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [9]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [10]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [12]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [13]:
frame2['debt'] = np.arange(5.)

In [14]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [15]:
val = Series([-1.2,-1.5,-1.7], index=['two','four','five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [16]:
frame2['eastern'] = frame2.state == 'Ohio'

In [17]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [18]:
del frame2['eastern']

In [19]:
# The column returned when indexing a DataFrame is a view
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [20]:
# Another common form of data is a nested dict of dicts
pop = {'Nevada':{2001:2.4, 2002:2.9},
      'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [21]:
frame3 = DataFrame(pop)

In [22]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [23]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [24]:
DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [25]:
pdata = {'Ohio':frame3['Ohio'][:-1],
        'Nevada':frame3['Nevada'][:2]}

In [26]:
DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [27]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [28]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [29]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

Index Objects

In [30]:
obj = Series(range(3), index=['a','b','c'])

In [31]:
index = obj.index

In [32]:
index

Index(['a', 'b', 'c'], dtype='object')

In [33]:
# Index objects are immutable
index[1:]

Index(['b', 'c'], dtype='object')

In [34]:
index = pd.Index(np.arange(3))

In [35]:
obj2 = Series([1.5,-2.5,0], index=index)

In [36]:
obj2.index is index

True

In [37]:
# Index functions as a fixed-size set
'Ohio' in frame3.columns
2003 in frame3.index

False

Essential Functionality

Reindexing

In [38]:
obj = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [39]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [40]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [41]:
obj.reindex(['a','b','c','d','e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [43]:
# interpolation
obj3 = Series(['blue','purple','yellow'], index=[0,2,4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [44]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'],
                 columns=['Ohio','Texas','California'])

In [45]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [46]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [47]:
states = ['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

Dropping entires from an axis

In [49]:
obj = Series(np.arange(5.), index=['a','b','c','d','e'])

In [50]:
new_obj = obj.drop('c')

In [51]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [52]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['Ohio','Colorado','Utah','New York'],
                columns=['one','two','three','four'])

In [53]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [54]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [55]:
data.drop(['two','four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

Indexing, selection, and filtering

In [56]:
obj = Series(np.arange(4.), index=['a','b','c','d'])

In [57]:
obj['b']

1.0

In [58]:
obj[1]

1.0

In [59]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [60]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [61]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [62]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [63]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [64]:
obj['b':'c']=5

In [65]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [66]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['Ohio','Colorado','Utah','New York'],
                columns=['one','two','three','four'])

In [67]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [68]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [69]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [70]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [71]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [74]:
data[data<5] = 0

In [75]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [76]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [77]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [79]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

Arithmetic and data alignment

In [87]:
s1 = Series([7.3,-2.5,3.4,1.5], index=['a','c','d','e'])

In [89]:
s2 = Series([-2.1,3.6,-1.5,4,3.1], index=['a','c','e','f','g'])

In [90]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [91]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'), index=['Ohio','Texas','Colorado'])

In [93]:
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
               index=['Utah','Ohio','Texas','Oregon'])

In [94]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

Arithmetic methods with fill values

In [96]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [97]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [98]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [99]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

Operations between DataFrame and Series

In [100]:
arr = np.arange(12.).reshape((3,4))

In [101]:
arr[0]

array([0., 1., 2., 3.])

In [102]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [103]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])

In [104]:
series = frame.iloc[0]

In [105]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [106]:
series2 = Series(range(3), index=['b','e','f'])
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [107]:
series3 = frame['d']

In [108]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

Function application and mapping

In [109]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])

In [110]:
np.abs(frame)

               b         d         e
Utah    0.445607  0.414504  0.556628
Ohio    0.266319  1.573566  0.531733
Texas   1.160789  1.479650  0.580324
Oregon  1.724277  1.606478  0.655931

In [111]:
# Apply a function on 1D arrays to each column or row
f = lambda x: x.max() - x.min()

In [112]:
frame.apply(f)

b    1.457958
d    3.180044
e    1.236255
dtype: float64

In [113]:
frame.apply(f,axis=1)

Utah      1.002236
Ohio      1.839885
Texas     2.059973
Oregon    1.068346
dtype: float64

In [114]:
def f(x):
    return Series([x.min(), x.max()], index=['min','max'])

In [116]:
frame.apply(f)

            b         d         e
min  0.266319 -1.573566 -0.580324
max  1.724277  1.606478  0.655931

In [118]:
format1 = lambda x: '%.2f' % x
frame.applymap(format1)

           b      d      e
Utah    0.45   0.41  -0.56
Ohio    0.27  -1.57  -0.53
Texas   1.16   1.48  -0.58
Oregon  1.72   1.61   0.66

In [119]:
# Series has a map method for applying an element-wise function:
frame['e'].map(format)

Utah      -0.56
Ohio      -0.53
Texas     -0.58
Oregon     0.66
Name: e, dtype: object

Sorting and ranking

In [120]:
obj = Series(range(4),index=['d','a','b','c'])

In [121]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [122]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three','one'],
                  columns = ['d','a','b','c'])

In [123]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [124]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [125]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [126]:
obj=Series([4,7,-3,2])

In [128]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [129]:
frame = DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})

In [130]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [132]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [133]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [134]:
obj = Series([7,-5,7,4,2,0,4])

In [135]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [136]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [137]:
obj.rank(ascending=False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

Axis Indexes with duplicate values

In [138]:
obj = Series(range(5), index=['a','a','b','b','c'])

In [139]:
obj.index.is_unique

False

In [140]:
obj['a']

a    0
a    1
dtype: int64

In [141]:
obj['c']

4

In [142]:
df = DataFrame(np.random.randn(4,3), index=['a','a','b','b'])

In [143]:
df.loc['b']

          0         1         2
b  0.125653 -1.103141 -0.868894
b -0.743285  0.070194  0.247900

Summarizing and Computing descriptive statistics

In [145]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],
               index=['a','b','c','d'],columns=['one','two'])

In [146]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [147]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [148]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [149]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [150]:
df.idxmax()

one    b
two    d
dtype: object

In [151]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [152]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [153]:
obj = Series(['a','a','b','c']*4)

In [154]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

Correlation and Covariance

In [163]:
pip install pandas-datareader

Collecting pandas-datareaderNote: you may need to restart the kernel to use updated packages.
  Downloading pandas_datareader-0.9.0-py3-none-any.whl (107 kB)
Requirement already satisfied: pandas>=0.23 in c:\users\yuqia\anaconda3\lib\site-packages (from pandas-datareader) (1.0.5)
Requirement already satisfied: lxml in c:\users\yuqia\anaconda3\lib\site-packages (from pandas-datareader) (4.5.2)
Requirement already satisfied: requests>=2.19.0 in c:\users\yuqia\anaconda3\lib\site-packages (from pandas-datareader) (2.24.0)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\yuqia\anaconda3\lib\site-packages (from pandas>=0.23->pandas-datareader) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\yuqia\anaconda3\lib\site-packages (from pandas>=0.23->pandas-datareader) (2020.1)
Requirement already satisfied: numpy>=1.13.3 in c:\users\yuqia\anaconda3\lib\site-packages (from pandas>=0.23->pandas-datareader) (1.18.5)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in c:\users\yuqia\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (1.25.9)
Requirement already satisfied: idna<3,>=2.5 in c:\users\yuqia\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (2.10)
Requirement already satisfied: chardet<4,>=3.0.2 in c:\users\yuqia\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (3.0.4)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\yuqia\anaconda3\lib\site-packages (from requests>=2.19.0->pandas-datareader) (2020.6.20)
Requirement already satisfied: six>=1.5 in c:\users\yuqia\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas>=0.23->pandas-datareader) (1.15.0)
Installing collected packages: pandas-datareader
Successfully installed pandas-datareader-0.9.0

In [2]:
pip install yfinance --upgrade --no-cache-dir

Collecting yfinance
  Downloading yfinance-0.1.55.tar.gz (23 kB)
Requirement already satisfied, skipping upgrade: pandas>=0.24 in c:\users\yuqia\anaconda3\lib\site-packages (from yfinance) (1.0.5)
Requirement already satisfied, skipping upgrade: numpy>=1.15 in c:\users\yuqia\anaconda3\lib\site-packages (from yfinance) (1.18.5)
Requirement already satisfied, skipping upgrade: requests>=2.20 in c:\users\yuqia\anaconda3\lib\site-packages (from yfinance) (2.24.0)
Collecting multitasking>=0.0.7
  Downloading multitasking-0.0.9.tar.gz (8.1 kB)
Requirement already satisfied, skipping upgrade: lxml>=4.5.1 in c:\users\yuqia\anaconda3\lib\site-packages (from yfinance) (4.5.2)
Requirement already satisfied, skipping upgrade: pytz>=2017.2 in c:\users\yuqia\anaconda3\lib\site-packages (from pandas>=0.24->yfinance) (2020.1)
Requirement already satisfied, skipping upgrade: python-dateutil>=2.6.1 in c:\users\yuqia\anaconda3\lib\site-packages (from pandas>=0.24->yfinance) (2.8.1)
Requirement already satisfied, skipping upgrade: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in c:\users\yuqia\anaconda3\lib\site-packages (from requests>=2.20->yfinance) (1.25.9)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied, skipping upgrade: certifi>=2017.4.17 in c:\users\yuqia\anaconda3\lib\site-packages (from requests>=2.20->yfinance) (2020.6.20)
Requirement already satisfied, skipping upgrade: idna<3,>=2.5 in c:\users\yuqia\anaconda3\lib\site-packages (from requests>=2.20->yfinance) (2.10)

Requirement already satisfied, skipping upgrade: chardet<4,>=3.0.2 in c:\users\yuqia\anaconda3\lib\site-packages (from requests>=2.20->yfinance) (3.0.4)
Requirement already satisfied, skipping upgrade: six>=1.5 in c:\users\yuqia\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas>=0.24->yfinance) (1.15.0)
Building wheels for collected packages: yfinance, multitasking
  Building wheel for yfinance (setup.py): started
  Building wheel for yfinance (setup.py): finished with status 'done'
  Created wheel for yfinance: filename=yfinance-0.1.55-py2.py3-none-any.whl size=22622 sha256=c125c179de98e838dd8f4324311d9fd725799e01c5832595797c4bce315eb1f9
  Stored in directory: C:\Users\yuqia\AppData\Local\Temp\pip-ephem-wheel-cache-6jsvcoet\wheels\b4\c3\39\9c01ae2b4726f37024bba5592bec868b47a2fab5a786e8979a
  Building wheel for multitasking (setup.py): started
  Building wheel for multitasking (setup.py): finished with status 'done'
  Created wheel for multitasking: filename=multitasking-0.0.9-py3-none-any.whl size=8374 sha256=5a2e1fff9ad5fdb40885b06506657270463b8a6cc665252bccf786a99bcd8b27
  Stored in directory: C:\Users\yuqia\AppData\Local\Temp\pip-ephem-wheel-cache-6jsvcoet\wheels\57\6d\a3\a39b839cc75274d2acfb1c58bfead2f726c6577fe8c4723f13
Successfully built yfinance multitasking
Installing collected packages: multitasking, yfinance
Successfully installed multitasking-0.0.9 yfinance-0.1.55

In [3]:
!jupyter notebook list

Currently running servers:
http://localhost:8888/?token=2f499f57cec1f10d9891174590e76945c7dd37356307cc64 :: C:\Users\yuqia

In [15]:
import yfinance as yf

In [16]:
aapl = yf.Ticker('AAPL')

In [17]:
hist = aapl.history(period='max')

In [18]:
type(hist)

pandas.core.frame.DataFrame

In [19]:
hist

,Open,High,Low,Close,Volume,Dividends,Stock Splits
Date,,,,,,,
1980-12-12,0.100922,0.101361,0.100922,0.100922,469033600,0.0,0.0
1980-12-15,0.096096,0.096096,0.095657,0.095657,175884800,0.0,0.0
1980-12-16,0.089075,0.089075,0.088636,0.088636,105728000,0.0,0.0
1980-12-17,0.090830,0.091268,0.090830,0.090830,86441600,0.0,0.0
1980-12-18,0.093463,0.093902,0.093463,0.093463,73449600,0.0,0.0
...,...,...,...,...,...,...,...
2021-03-01,123.750000,127.930000,122.790001,127.790001,115998300,0.0,0.0
2021-03-02,128.410004,128.720001,125.010002,125.120003,102015300,0.0,0.0
2021-03-03,124.809998,125.709999,121.839996,122.059998,112430400,0.0,0.0
2021-03-04,121.750000,123.599998,118.620003,120.129997,177275300,0.0,0.0
2021-03-05,120.980003,121.940002,117.570000,121.419998,153590400,0.0,0.0

In [20]:
all_data = {}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = yf.download(ticker, start='2000-01-01', end='2010-01-01')

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

In [23]:
import pandas as pd
from pandas import Series, DataFrame
price = DataFrame({tic:data['Adj Close'] for tic, data in all_data.items()})

In [24]:
volume = DataFrame({tic:data['Volume'] for tic, data in all_data.items()})

In [25]:
price

                AAPL        IBM       MSFT        GOOG
Date
2000-01-03  0.860883  72.891006  37.017384         NaN
2000-01-04  0.788302  70.416786  35.766914         NaN
2000-01-05  0.799837  72.891006  36.144032         NaN
2000-01-06  0.730621  71.634270  34.933285         NaN
2000-01-07  0.765229  71.320068  35.389793         NaN
...              ...        ...        ...         ...
2009-12-24  6.430691  91.215378  24.088821  308.085236
2009-12-28  6.509755  92.430878  24.220924  310.272034
2009-12-29  6.432538  92.109535  24.391872  308.543518
2009-12-30  6.510676  92.612495  24.057743  310.202301
2009-12-31  6.482683  91.445862  23.684755  308.832428

[2515 rows x 4 columns]

In [26]:
returns = price.pct_change()

In [29]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2009-12-24  0.034339  0.004385  0.002587  0.011117
2009-12-28  0.012295  0.013326  0.005484  0.007098
2009-12-29 -0.011862 -0.003477  0.007058 -0.005571
2009-12-30  0.012147  0.005460 -0.013698  0.005376
2009-12-31 -0.004300 -0.012597 -0.015504 -0.004416

In [30]:
type(returns)

pandas.core.frame.DataFrame

In [37]:
returns['MSFT'].corr(returns.IBM)

0.49597957364547707

In [33]:
returns.MSFT.cov(returns.IBM)

0.00021595755054081313

In [36]:
type(returns['MSFT'])

pandas.core.series.Series

In [38]:
 returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.410011  0.424305  0.470676
IBM   0.410011  1.000000  0.495980  0.390688
MSFT  0.424305  0.495980  1.000000  0.443586
GOOG  0.470676  0.390688  0.443586  1.000000

In [39]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.001027  0.000252  0.000309  0.000303
IBM   0.000252  0.000367  0.000216  0.000142
MSFT  0.000309  0.000216  0.000516  0.000205
GOOG  0.000303  0.000142  0.000205  0.000580

In [40]:
returns.corrwith(returns.IBM)

AAPL    0.410011
IBM     1.000000
MSFT    0.495980
GOOG    0.390688
dtype: float64

In [41]:
returns.corrwith(volume)

AAPL   -0.057549
IBM    -0.007892
MSFT   -0.014245
GOOG    0.062648
dtype: float64

Unique values, value counts, and membership

In [42]:
obj = Series(['c','a','d','a','a','b','b','c','c'])

In [43]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [44]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [45]:
pd.value_counts(obj.values, sort=False)

b    2
d    1
c    3
a    3
dtype: int64

In [46]:
mask = obj.isin(['b','c'])

In [47]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [48]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [49]:
data = DataFrame({'Qu1':[1,3,4,3,4],
                 'Qu2':[2,3,1,2,3],
                 'Qu3':[1,5,2,4,4]})

In [50]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [51]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

Handling Missing Data

In [53]:
import numpy as np
string_data = Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [58]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

Filtering out missing data

In [59]:
from numpy import nan as NA
data = Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [60]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [61]:
data = DataFrame([[1.,6.5,3.],[1., NA, NA],
                 [NA,NA,NA],[NA,6.5,3.]])

In [64]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [65]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [66]:
data[4] = NA

In [67]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [71]:
df = DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.686266  1.790889 -0.670223
1  2.146990 -0.872335  0.297941
2 -1.341809  1.435590 -0.036921
3  0.133325 -0.491368  1.061930
4  0.595485  0.026676 -0.000013
5  2.615052 -0.840654 -0.615732
6 -1.078328 -1.017681  1.545321

In [78]:
df.iloc[:5,1]=NA
df

          0         1         2
0 -0.686266       NaN       NaN
1  2.146990       NaN       NaN
2 -1.341809       NaN -0.036921
3  0.133325       NaN  1.061930
4  0.595485       NaN -0.000013
5  2.615052 -0.840654 -0.615732
6 -1.078328 -1.017681  1.545321

In [79]:
df.iloc[:2,2]=NA
df

          0         1         2
0 -0.686266       NaN       NaN
1  2.146990       NaN       NaN
2 -1.341809       NaN -0.036921
3  0.133325       NaN  1.061930
4  0.595485       NaN -0.000013
5  2.615052 -0.840654 -0.615732
6 -1.078328 -1.017681  1.545321

In [80]:
df.dropna(thresh=3)

          0         1         2
5  2.615052 -0.840654 -0.615732
6 -1.078328 -1.017681  1.545321

Filling in missing data

In [81]:
df.fillna(0)

          0         1         2
0 -0.686266  0.000000  0.000000
1  2.146990  0.000000  0.000000
2 -1.341809  0.000000 -0.036921
3  0.133325  0.000000  1.061930
4  0.595485  0.000000 -0.000013
5  2.615052 -0.840654 -0.615732
6 -1.078328 -1.017681  1.545321

In [82]:
df.fillna({1:0.5,3:-1})

          0         1         2
0 -0.686266  0.500000       NaN
1  2.146990  0.500000       NaN
2 -1.341809  0.500000 -0.036921
3  0.133325  0.500000  1.061930
4  0.595485  0.500000 -0.000013
5  2.615052 -0.840654 -0.615732
6 -1.078328 -1.017681  1.545321

In [83]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)

In [84]:
df

          0         1         2
0 -0.686266  0.000000  0.000000
1  2.146990  0.000000  0.000000
2 -1.341809  0.000000 -0.036921
3  0.133325  0.000000  1.061930
4  0.595485  0.000000 -0.000013
5  2.615052 -0.840654 -0.615732
6 -1.078328 -1.017681  1.545321

In [86]:
print(_)

None

In [87]:
df = DataFrame(np.random.randn(6,3))

In [88]:
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA

In [89]:
df

          0         1         2
0 -1.564353  0.351105  0.798172
1  0.694877  1.339891  1.226063
2 -0.219460       NaN  2.389661
3  0.986549       NaN  0.465335
4  0.075533       NaN       NaN
5  0.390307       NaN       NaN

In [91]:
df.fillna(method='ffill')

          0         1         2
0 -1.564353  0.351105  0.798172
1  0.694877  1.339891  1.226063
2 -0.219460  1.339891  2.389661
3  0.986549  1.339891  0.465335
4  0.075533  1.339891  0.465335
5  0.390307  1.339891  0.465335

In [92]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.564353  0.351105  0.798172
1  0.694877  1.339891  1.226063
2 -0.219460  1.339891  2.389661
3  0.986549  1.339891  0.465335
4  0.075533       NaN  0.465335
5  0.390307       NaN  0.465335

In [93]:
data = Series([1., NA, 3.5, NA, 7])

In [94]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

Hierarchical indexing

In [96]:
data = Series(np.random.randn(10), index=[['a','a','a','b','b','b','c','c','d'
                                          ,'d'],[1,2,3,1,2,3,1,2,2,3]])

In [97]:
# The 'gaps' in the index display mean "use the label directly above"
data

a  1   -0.616939
   2   -0.014734
   3   -1.001379
b  1    0.384586
   2    0.837542
   3    1.351289
c  1   -0.424057
   2   -0.710582
d  2   -0.798247
   3    0.768353
dtype: float64

In [98]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [99]:
data['b']

1    0.384586
2    0.837542
3    1.351289
dtype: float64

In [100]:
data['b':'c']

b  1    0.384586
   2    0.837542
   3    1.351289
c  1   -0.424057
   2   -0.710582
dtype: float64

In [101]:
data.loc[['b','d']]

b  1    0.384586
   2    0.837542
   3    1.351289
d  2   -0.798247
   3    0.768353
dtype: float64

In [102]:
data[:,2]

a   -0.014734
b    0.837542
c   -0.710582
d   -0.798247
dtype: float64

In [103]:
data.unstack()

          1         2         3
a -0.616939 -0.014734 -1.001379
b  0.384586  0.837542  1.351289
c -0.424057 -0.710582       NaN
d       NaN -0.798247  0.768353

In [104]:
data.unstack().stack()

a  1   -0.616939
   2   -0.014734
   3   -1.001379
b  1    0.384586
   2    0.837542
   3    1.351289
c  1   -0.424057
   2   -0.710582
d  2   -0.798247
   3    0.768353
dtype: float64

In [105]:
frame = DataFrame(np.arange(12).reshape((4,3)),
                 index=[['a','a','b','b'], [1,2,1,2]],
                 columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [106]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [107]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [108]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [110]:
pd.MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']],
                      names=['state','color'])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

Reording and Sorting levels

In [111]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [115]:
frame.sort_index(1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [116]:
# Data selection performance is better if the index is lexicographically sorted
frame.swaplevel(0,1).sort_index(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

Summary statistics by level

In [117]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [118]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

Using a DataFrame's Columns

In [120]:
frame = DataFrame({'a':range(7), 'b':range(7,0,-1),
                  'c':['one','one','one','two','two','two','two'],
                  'd':[0,1,2,0,1,2,3]})

In [121]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [122]:
frame2 = frame.set_index(['c','d'])

In [123]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [124]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [125]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

Other pandas topics

Integer Indexing

In [126]:
ser = Series(np.arange(3.))

In [129]:
ser[-1]

KeyError: -1

Panel Data

In [139]:
pip install xarray

Collecting xarray
  Downloading xarray-0.17.0-py3-none-any.whl (759 kB)
Requirement already satisfied: pandas>=0.25 in c:\users\yuqia\anaconda3\lib\site-packages (from xarray) (1.0.5)
Requirement already satisfied: setuptools>=40.4 in c:\users\yuqia\anaconda3\lib\site-packages (from xarray) (49.2.0.post20200714)
Requirement already satisfied: numpy>=1.15 in c:\users\yuqia\anaconda3\lib\site-packages (from xarray) (1.18.5)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\yuqia\anaconda3\lib\site-packages (from pandas>=0.25->xarray) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\yuqia\anaconda3\lib\site-packages (from pandas>=0.25->xarray) (2020.1)
Requirement already satisfied: six>=1.5 in c:\users\yuqia\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas>=0.25->xarray) (1.15.0)
Installing collected packages: xarray
Successfully installed xarray-0.17.0
Note: you may need to restart the kernel to use updated packages.

In [9]:
from pandas import DataFrame
import yfinance as yf
import xarray

In [3]:
data = dict((stk, yf.download(stk, start='2009-01-01', end='2010-01-06'))
                     for stk in ['AAPL','GOOG','MSFT'])

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

In [8]:
type(data['AAPL'])

pandas.core.frame.DataFrame

In [11]:
data = yf.download(  # or pdr.get_data_yahoo(...
        # tickers list or string as well
        tickers = "SPY AAPL MSFT",

        start='2009-01-01', end='2010-01-06',

        # group by ticker (to access via data['SPY'])
        # (optional, default is 'column')
        group_by = 'ticker',

        # adjust all OHLC automatically
        # (optional, default is False)
        auto_adjust = True,

        # download pre/post regular market hours data
        # (optional, default is False)
        prepost = True,

        # use threads for mass downloading? (True/False/Integer)
        # (optional, default is True)
        threads = True,

        # proxy URL scheme use use when downloading?
        # (optional, default is None)
        proxy = None
    )

[*********************100%***********************]  3 of 3 completed

In [12]:
data.head()

                 MSFT                                                   SPY  \
                 Open       High        Low      Close    Volume       Open
Date
2009-01-02  14.828208  15.488757  14.706728  15.435610  50084000  71.045210
2009-01-05  15.336909  15.693757  15.230612  15.579869  61475200  72.765555
2009-01-06  15.754501  15.944314  15.648206  15.762094  58083400  73.558957
2009-01-07  15.329317  15.405242  14.790246  14.813025  72709900  72.270675
2009-01-08  14.904128  15.329311  14.843388  15.276163  70255400  70.825273

                                                            AAPL            \
                 High        Low      Close     Volume      Open      High
Date
2009-01-02  73.401863  70.581732  73.024796  227566300  2.641925  2.800662
2009-01-05  73.574677  72.184249  72.938377  240349700  2.866187  2.958783
2009-01-06  74.195251  72.804829  73.425415  328260900  2.951709  2.989239
2009-01-07  72.474920  70.856681  71.225891  280899200  2.824350  2.845576
2009-01-08  71.555830  70.440349  71.516556  263834400  2.781897  2.865572


                 Low     Close      Volume
Date
2009-01-02  2.619776  2.791740   746015200
2009-01-05  2.852036  2.909563  1181608400
2009-01-06  2.842192  2.861573  1289310400
2009-01-07  2.776667  2.799739   753048800
2009-01-08  2.769899  2.851728   673500800

In [14]:
data.index

DatetimeIndex(['2009-01-02', '2009-01-05', '2009-01-06', '2009-01-07',
               '2009-01-08', '2009-01-09', '2009-01-12', '2009-01-13',
               '2009-01-14', '2009-01-15',
               ...
               '2009-12-21', '2009-12-22', '2009-12-23', '2009-12-24',
               '2009-12-28', '2009-12-29', '2009-12-30', '2009-12-31',
               '2010-01-04', '2010-01-05'],
              dtype='datetime64[ns]', name='Date', length=254, freq=None)

In [17]:
data.columns.names

FrozenList([None, None])

In [18]:
data.describe()

             MSFT                                                    \
             Open        High         Low       Close        Volume
count  254.000000  254.000000  254.000000  254.000000  2.540000e+02
mean    17.705591   17.945212   17.505479   17.738525  6.228669e+07
std      3.397095    3.373062    3.444804    3.416694  2.765921e+07
min     11.619771   11.940842   11.367498   11.581548  1.108390e+07
25%     14.828206   15.037949   14.524715   14.769339  4.708990e+07
50%     18.021537   18.225038   17.851917   18.017323  5.790385e+07
75%     19.803234   20.035321   19.731666   19.896066  6.938162e+07
max     24.360791   24.477349   24.267543   24.391872  2.817610e+08

              SPY                                                    \
             Open        High         Low       Close        Volume
count  254.000000  254.000000  254.000000  254.000000  2.540000e+02
mean    75.508977   76.249182   74.786313   75.562577  2.452482e+08
std      9.675923    9.461503    9.870028    9.690779  9.880626e+07
min     53.378173   54.988555   52.710454   53.503864  3.967750e+07
25%     67.652090   68.639453   66.769079   67.894520  1.711668e+08
50%     74.354474   75.120586   73.772957   74.591827  2.274426e+08
75%     84.605926   85.247467   83.870447   84.699854  2.939213e+08
max     91.031174   91.368742   90.701639   91.328552  5.362128e+08

             AAPL
             Open        High         Low       Close        Volume
count  254.000000  254.000000  254.000000  254.000000  2.540000e+02
mean     4.526765    4.584290    4.475987    4.532762  5.683044e+08
std      1.240970    1.236428    1.234268    1.233587  2.127271e+08
min      2.442273    2.522563    2.405664    2.405664  2.864540e+08
25%      3.518593    3.576659    3.486676    3.545357  4.212243e+08
50%      4.381571    4.426024    4.315892    4.381725  5.186734e+08
75%      5.755215    5.801898    5.689997    5.725528  6.847813e+08
max      6.601736    6.632191    6.560205    6.594968  1.831634e+09

In [19]:
data['MSFT']

                 Open       High        Low      Close    Volume
Date
2009-01-02  14.828208  15.488757  14.706728  15.435610  50084000
2009-01-05  15.336909  15.693757  15.230612  15.579869  61475200
2009-01-06  15.754501  15.944314  15.648206  15.762094  58083400
2009-01-07  15.329317  15.405242  14.790246  14.813025  72709900
2009-01-08  14.904128  15.329311  14.843388  15.276163  70255400
...               ...        ...        ...        ...       ...
2009-12-29  24.360791  24.477349  24.267543  24.391872  29716200
2009-12-30  24.205385  24.314174  23.933414  24.057743  42006200
2009-12-31  24.073285  24.081056  23.684755  23.684755  31929700
2010-01-04  23.793539  24.166527  23.770227  24.049969  38409100
2010-01-05  23.972268  24.166532  23.809084  24.057743  49749600

[254 rows x 5 columns]

In [22]:
data.columns

MultiIndex([('MSFT',   'Open'),
            ('MSFT',   'High'),
            ('MSFT',    'Low'),
            ('MSFT',  'Close'),
            ('MSFT', 'Volume'),
            ( 'SPY',   'Open'),
            ( 'SPY',   'High'),
            ( 'SPY',    'Low'),
            ( 'SPY',  'Close'),
            ( 'SPY', 'Volume'),
            ('AAPL',   'Open'),
            ('AAPL',   'High'),
            ('AAPL',    'Low'),
            ('AAPL',  'Close'),
            ('AAPL', 'Volume')],
           )

In [23]:
data.columns.names = ['ticker','info']

In [24]:
data.columns.names

FrozenList(['ticker', 'info'])

In [25]:
data.unstack(level='ticker')

KeyError: 'Requested level (ticker) does not match index name (Date)'

In [26]:
data.unstack()

ticker  info    Date
MSFT    Open    2009-01-02    1.482821e+01
                2009-01-05    1.533691e+01
                2009-01-06    1.575450e+01
                2009-01-07    1.532932e+01
                2009-01-08    1.490413e+01
                                  ...
AAPL    Volume  2009-12-29    4.452056e+08
                2009-12-30    4.120844e+08
                2009-12-31    3.524108e+08
                2010-01-04    4.937296e+08
                2010-01-05    6.019048e+08
Length: 3810, dtype: float64

For more info on panel data manipulation refer to:
https://python.quantecon.org/pandas_panel.html